{
  "contact": {
    "site": "https://asmith-99.github.io",
    "email": "aiden.smith10@gmail.com"
  },
  "about": [
    "I am a software developer with a strong academic background in computer science, physics, and mathematics. I'm a quick learner with a scientific mindset; I thrive when given ambitious goals or tricky problems to solve, and always endeavor to understand them at their root in order to do so.",
    "I excel working independently or in team environments. I am exceptional at teaching others and efficiently finding and bridging knowledge gaps."
  ],
  "skills": [
    "JavaScript",
    "React",
    "Redux",
    "Node.js",
    "HTML/CSS",
    "Cloud (AWS)",
    "FFmpeg",
    "Unix",
    "C / C++",
    "Java",
    "Python",
    "Matlab",
    "Fusion 360",
    "Git"
  ],
  "experience": [
    {
      "workplace": "Castofly Technologies Inc.",
      "title": "Lead Software Engineer / Full Stack Developer",
      "duration": "2021 - 2025",
      "blurb": "I was hired by this startup as an intern in 2021 to assist their transition to a web app. I was later promoted from intern to software developer to lead software engineer, and took on every role related to modern web applications- frontend, backend, architecture, QA, DevOps, design, and more.",
      "points": [
        "Migrated a Java app to a web app, featuring real-time collaboration, audio/video editing, multi-user undo and redo, permissions management, and a file/folder-based project organization system.",
        "Designed and implemented a backend using infrastructure-as-code (AWS CDK) and AWS services including Lambda, API Gateway, DynamoDB, S3, Route53, Cloudfront, SNS, and Secrets Manager.",
        "Implemented a multi-user undo/redo algorithm based on published academic research papers, enabling synchronized and error-free collaboration.",
        "Assisted with the development of a video generation pipeline for converting user projects into high-quality downloadable videos using FFmpeg, Node, and Konva.",
        "Performed R&D into optimization; implemented a compression algorithm into project loading that reduced loading time by 85%.",
        "Eliminated unnecessary AWS Services expenses, reducing per-environment monthly costs by 67%.",
        "Prepared presentations and documentation to promote a deep and thorough understanding and ensure that the results of research projects are effectively communicated.",
        "Developed a Chrome extension to help users automatically create how-to guides by capturing their interactions with a website."
      ]
    },
    {
      "workplace": "University of British Columbia",
      "title": "Physics and Astronomy Demo Room Assistant",
      "duration": "2018 - 2020",
      "blurb": "",
      "points": [
        "Prepared, facilitated, and ran physics demonstrations for physics courses at UBC; improving student engagement and learning outcomes.",
        "Worked with professors and outreach staff to decide on appropriate physics demos to illustrate physics concepts.",
        "Maintained, repaired, designed, and created physics demonstrations.",
        "Designed and implemented a new demonstration room website featuring a catalogue of all demonstrations and updated or rewrote technical writing for over a hundred demonstrations.",
        "Worked with physics outreach staff to assist with/run physics-themed science shows.",
        "Assisted in coordinating a major move and reorganizing afterwards."
      ]
    },
    {
      "workplace": "Self-employed",
      "title": "Tutor",
      "duration": "Summer 2016, 2017",
      "blurb": "",
      "points": [
        "Reviewed and reinforced grade 10-12 level mathematics and chemistry with several students.",
        "Worked with the student to find and correct faults in understanding while providing rationalization and foundation in previously learned topics."
      ]
    }
  ],
  "interests": [
    "DIY Electronics, robotics",
    "Hardware design",
    "3D Printing",
    "Science Fiction",
    "Video games",
    "D&D",
    "Astronomy",
    "Cooking and baking",
    "Musical theater, choir"
  ],
  "activities": [
    {
      "activity": "UBC Open Robotics",
      "role": "Subteam Lead",
      "duration": "2017-2020",
      "description": [
        "Lead a team of six to design, source components for, manufacture, and write the software for an art-creating delta robot, intended to be entered into the Robot Art competition.",
        "During the COVID-19 pandemic, pivoted to designing and building a shareable, miniature built-at-home version of the delta robot that each member could work with independently."
      ]
    },
    {
      "activity": "BC Game Jam 2020",
      "role": "",
      "duration": "2020",
      "description": [
        "Attended the 2020 BC Game Jam and developed a full game from scratch in Unity using C# over a 48 hour period as part of a two-person team."
      ]
    },
    {
      "activity": "UBC Choral Union Choir",
      "role": "",
      "duration": "2016-2019",
      "description": [
        "Performed with a group of over one-hundred and twenty, performing works such as Giuseppe Verdi's Requiem and Mozart's Requiem. Had the privilege of performing with the Vancouver Symphony Orchestra on multiple occasions. "
      ]
    }
  ],
  "projects": [
    {
      "name": "StarBG",
      "isAcademic": false,
      "duration": "2025",
      "blurb": "Dynamic Astronomical Website Background",
      "description": [
        "You're looking at it! A catalogue of the 9000 brightest stars is rendered into the browser using three.js. A preprocessing script prepares the data for the browser, mapping magnitudes and color indices to sizes and RGB colors. Custom shaders are used to pass color and size data to a particle rendering system to enable performant rendering of a large number of stars. The same custom shaders are also used to add a dynamic 'sparkle' effect."
      ],
      "coverImage": "/projects/starbg_cover.png",
      "links": [
        {
          "text": "Demo and writeup",
          "link": "/stars"
        }
      ]
    },
    {
      "name": "Tile Macropad",
      "isAcademic": false,
      "duration": "2024",
      "blurb": "Miniature 3D printed keyboard with unique design",
      "description": [
        "Designed, 3D printed, and built a useful mini-keyboard with a unique visual design making use of decorative glass tiles as key caps. Used Vial firmware to enable easy reconfiguration of functionality."
      ],
      "coverImage": "/projects/macropad_cover.png",
      "links": []
    },
    {
      "name": "Homeauto V1",
      "isAcademic": false,
      "duration": "2023",
      "blurb": "Hacked-together home automation system",
      "description": [
        "Off-the-shelf RF-controlled outlet switches are controlled using a RF transmitter attached to a Raspberry Pi. The Raspberry Pi is running a Node.JS + Express server, which serves both a React web-app and an API that can control the outlet switches via the RF transmitter. The website, accessible to any devices on the network, allows the user to view and toggle the state of all connected outlet switches."
      ],
      "coverImage": "/projects/homeauto_cover.png",
      "links": []
    },
    {
      "name": "Autonomous 'Pet' Robot ",
      "isAcademic": false,
      "duration": "2022",
      "blurb": "Compact feline inspired wheeled robot",
      "description": [
        "Designed and built a compact autonomous two-wheeled robot with a suite of sensors (ultrasonic, touch, light) and a visual design with servo-actuated ‘ears’ to imitate the behavior of household pets. "
      ],
      "coverImage": "/projects/catbot_cover.png",
      "links": []
    },
    {
      "name": "StarPointer",
      "isAcademic": false,
      "duration": "2019",
      "blurb": "Star-indicating robotic laser pointer",
      "description": [
        "Designed and built a 2-axis robotic arm with a laser pointer affixed to the end. A controller written in C is relayed commands via serial connection from a Python program running on a PC, which provides coordinates corresponding to the direction to the stars in the sky corrected for the local time, longitude, and latitude."
      ],
      "coverImage": "/projects/starpointer_temp_cover.png",
      "links": []
    },
    {
      "name": "MP430 Robotic Arm",
      "isAcademic": true,
      "duration": "2021",
      "blurb": "4-axis robotic arm controlled by 'puppet'",
      "description": [
        "Designed and built a miniature 4-axis robotic arm, controlled using a matching 'puppet arm' with a potentiometer in each joint and driven using an MP430 microcontroller and firmware written in C."
      ],
      "coverImage": "/projects/msp430_arm_cover.png",
      "links": []
    },
    {
      "name": "Material based Ray-tracing Renderer",
      "isAcademic": true,
      "duration": "2020",
      "blurb": "Scratch-built C++ graphics engine",
      "description": [
        "Created a C++ program capable of rendering different types of scattering (diffuse, dielectric, and metallic) in scenes using the path-tracing method with global illumination, multisampling, light sources and depth of field."
      ],
      "coverImage": "/projects/pathtracer_cover.png",
      "links": []
    },
    {
      "name": "Time-Dependent Shrödinger Equation Solver",
      "isAcademic": true,
      "duration": "2020",
      "blurb": "Quantum-mechanical simulation in MATLAB",
      "description": [
        "Wrote a program in Matlab which solves for and visualizes the evolution of the time-dependent Shrödinger equation in 1D and 2D using the Crank-Nicholson method. Includes an experimental verification of the solvers convergence and error. "
      ],
      "coverImage": "/projects/schrodinger_cover.png",
      "links": []
    },
    {
      "name": "Galactic Collision Simulation",
      "isAcademic": true,
      "duration": "2020",
      "blurb": "Simplified model of galatic collision in MATLAB",
      "description": [
        "Wrote a program in Matlab which performs and visualizes a gravitational simulation of collisions between two or more galaxies based on the Toomre model. Includes calculations to demonstrate that the convergence of the FDA solver behaves as expected with changing step size."
      ],
      "coverImage": "/projects/galactic_collision.png",
      "links": []
    }
  ]
}
